app/Http/Controllers/Admin/UsersController.php

    public function index()
    {
        $users = User::all();
---
select * from `users`

    public function edit($id)
    {
        $user = User::whereId($id)->firstOrFail();
        $roles = Role::all();
---
select * from `users` where `id` = '5' limit 1
select * from `roles`

    public function update($id, UserEditFormRequest $request)
    {
        $user = User::whereId($id)->firstOrFail();
---
select * from `users` where `id` = '5' limit 1